<?php

// سنة أولى فصل أول 
$data[]=array("name2"=>"تحليل (1)م","name"=>"تحليل (1)م", "time"=>1, "year"=>1,"date"=>"2022/7/23") ;
$data[]=array("name2"=>"فيزياء (1)","name"=>"فيزياء (1)", "time"=>1, "year"=>1,"date"=>"2022/7/18") ;
$data[]=array("name2"=>"ثقافة (م)","name"=>"ثقافة (م)", "time"=>2, "year"=>1,"date"=>"2022/7/5");
$data[]=array("name2"=>"لغة اجنبية (1)م","name"=>"لغة اجنبية (1)م", "time"=>2, "year"=>1,"date"=>"2022/6/28");
$data[]=array("name2"=>"رياضيات متقطعة (م)","name"=>"رياضيات متقطعة (م)", "time"=>1, "year"=>1,"date"=>"2022/8/1");
$data[]=array("name2"=>"برمجة (1)م","name"=>"برمجة (1)م", "time"=>1, "year"=>1,"date"=>"2022/7/6");
$data[]=array("name2"=>"مبادئ عمل الحواسيب (م)","name"=>"مبادئ عمل الحواسيب (م)", "time"=>3, "year"=>1,"date"=>"2022/7/2");
// سنة أولى فصل ثاني 
$data[]=array("name2"=>"فيزياء (2)م","name"=>"فيزياء (2)م", "time"=>1, "year"=>1,"date"=>"2022/7/3") ;
$data[]=array("name2"=>"جبر خطي","name"=>"جبر خطي", "time"=>1, "year"=>1,"date"=>"2022/8/4");
$data[]=array("name2"=>"دارات كهربائية","name"=>"دارات كهربائية", "time"=>1, "year"=>1,"date"=>"2022/7/26");
$data[]=array("name2"=>"تحليل (2)م","name"=>"تحليل (2)م", "time"=>1, "year"=>1,"date"=>"2022/6/26");
$data[]=array("name2"=>"لغة عربية","name"=>"لغة عربية", "time"=>1, "year"=>1,"date"=>"2022/7/31");
$data[]=array("name2"=>"لغة اجنبية (2)م","name"=>"لغة اجنبية (2)م", "time"=>2, "year"=>1,"date"=>"2022/7/19");
$data[]=array("name2"=>"برمجة (2)","name"=>"برمجة (2)", "time"=>3, "year"=>1,"date"=>"2022/7/16");


// سنة ثانية فصل أول 
$data[]=array("name2"=>"احتمالات (م)","name"=>"احتمالات (م)", "time"=>3, "year"=>2,"date"=>"2022/7/4") ;
$data[]=array("name2"=>"تحليل عددي (1)","name"=>"تحليل عددي (1)", "time"=>1, "year"=>2,"date"=>"2022/7/25");
$data[]=array("name2"=>"برمجة رياضية","name"=>"برمجة رياضية", "time"=>1, "year"=>2,"date"=>"2022/7/21");
$data[]=array("name2"=>"برمجة (3)","name"=>"برمجة (3)", "time"=>1, "year"=>2,"date"=>"2022/7/30");
$data[]=array("name2"=>"الكترونيات","name"=>"الكترونيات", "time"=>3, "year"=>2,"date"=>"2022/7/24");
$data[]=array("name2"=>"لغة اجنبية (3)م","name"=>"لغة اجنبية (3)م", "time"=>1, "year"=>2,"date"=>"2022/6/28");
$data[]=array("name2"=>"تحليل (3)م","name"=>"تحليل (3)م", "time"=>1, "year"=>2,"date"=>"2022/7/19");
// سنة ثانية فصل ثاني
$data[]=array("name2"=>"لغة اجنبية (4)م","name"=>"لغة اجنبية (4)م", "time"=>1, "year"=>2,"date"=>"2022/6/30") ;
$data[]=array("name2"=>"تحليل (4)م","name"=>"تحليل (4)م", "time"=>3, "year"=>2,"date"=>"2022/7/17") ;
$data[]=array("name2"=>"خوارزميات (1)","name"=>"خوارزميات (1)", "time"=>3, "year"=>2,"date"=>"2022/6/27");
$data[]=array("name2"=>"تحليل عددي (2)","name"=>"تحليل عددي (2)", "time"=>3, "year"=>2,"date"=>"2022/8/1");
$data[]=array("name2"=>"نظم ودارات منطقية","name"=>"نظم ودارات منطقية", "time"=>3, "year"=>2,"date"=>"2022/7/27");
$data[]=array("name2"=>"مهارات تواصل (م)", "name"=>"مهارات تواصل (م)", "time"=>5, "year"=>2,"date"=>"2022/8/4");
$data[]=array("name2"=>"احصاء (م)","name"=>"احصاء (م)", "time"=>3, "year"=>2,"date"=>"2022/7/6");


// سنة ثالثة فصل أول
$data[]=array("name2"=>"خوارزميات (2)","name"=>"خوارزميات (2)", "time"=>3, "year"=>3,"date"=>"2022/7/18");
$data[]=array("name2"=>"معالج مصغر","name"=>"معالج مصغر", "time"=>1, "year"=>3,"date"=>"2022/8/1");
$data[]=array("name2"=>"معالجة اشارة","name"=>"معالجة اشارة", "time"=>1, "year"=>3,"date"=>"2022/7/2");
$data[]=array("name2"=>"قواعد معطيات  (1)","name"=>"قواعد معطيات  (1)", "time"=>1, "year"=>3,"date"=>"2022/7/4");
$data[]=array("name2"=>"رسوميات حاسوبية","name"=>"رسوميات حاسوبية", "time"=>3, "year"=>3,"date"=>"2022/7/26");
$data[]=array("name2"=>"نظرية معلومات","name"=>"نظرية معلومات", "time"=>2, "year"=>3,"date"=>"2022/6/28");
$data[]=array("name2"=>"نظرية المخططات","name"=>"نظرية المخططات", "time"=>3, "year"=>3,"date"=>"2022/7/20");
// سنة ثالثة فصل ثاني
$data[]=array("name2"=>"شبكات حاسوبية","name"=>"شبكات حاسوبية", "time"=>3, "year"=>3,"date"=>"2022/6/26");
$data[]=array("name2"=>"بنية وتنظيم الحاسب (1)","name"=>"بنية وتنظيم الحاسب (1)", "time"=>3, "year"=>3,"date"=>"2022/6/30");
$data[]=array("name2"=>"هندسة برمجيات (1)","name"=>"هندسة برمجيات (1)", "time"=>1, "year"=>3,"date"=>"2022/8/3");
$data[]=array("name2"=>"اتصالات تشابهية ورقمية","name"=>"اتصالات تشابهية ورقمية", "time"=>1, "year"=>3,"date"=>"2022/7/16");
$data[]=array("name2"=>"لغات صورية","name"=>"لغات صورية", "time"=>3, "year"=>3,"date"=>"2022/7/28");
$data[]=array("name2"=>"مبادئ الذكاء الصنعي","name"=>"مبادئ الذكاء الصنعي", "time"=>3, "year"=>3,"date"=>"2022/7/23");
$data[]=array("name2"=>"خوارزميات (3)","name"=>"خوارزميات (3)", "time"=>1, "year"=>3,"date"=>"2022/7/5");


// سنة رابعة فصل أول
$data[]=array("name2"=>"نظم تشغيل (1)","name"=>"نظم تشغيل (1)", "time"=>1, "year"=>4,"date"=>"2022/7/18") ;
$data[]=array("name2"=>"بنية وتنظيم الحاسب (2)","name"=>"بنية وتنظيم الحاسب (2)", "time"=>3, "year"=>4,"date"=>"2022/7/25") ;
$data[]=array("name2"=>"نظم رقمية مبرمجة","name"=>"نظم رقمية مبرمجة", "time"=>1, "year"=>4,"date"=>"2022/7/23");
$data[]=array("name2"=>"تصميم مترجمات","name"=>"تصميم مترجمات", "time"=>5, "year"=>4,"date"=>"2022/6/26");
$data[]=array("name2"=>"برمجة منطقية","name"=>"برمجة منطقية", "time"=>3, "year"=>4,"date"=>"2022/6/29");
$data[]=array("name2"=>"قواعد معطيات  (2)","name"=>"قواعد معطيات  (2)", "time"=>3, "year"=>4,"date"=>"2022/6/29");
$data[]=array("name2"=>"شبكات حاسوبية متقدمة","name"=>"شبكات حاسوبية متقدمة", "time"=>3, "year"=>4,"date"=>"2022/6/29");
$data[]=array("name2"=>"نظرية الارتال","name"=>"نظرية الارتال", "time"=>1, "year"=>4,"date"=>"2022/7/27");
$data[]=array("name2"=>"برمجة تفرعية","name"=>"برمجة تفرعية", "time"=>3, "year"=>4,"date"=>"2022/7/2");
// سنة رابعة فصل ثاني
$data[]=array("name2"=>"نظم وسائط متعددة", "name"=>"نظم وسائط متعددة", "time"=>3, "year"=>4,"date"=>"2022/8/4") ;
$data[]=array("name2"=>"تسويق وادارة مشاريع (م)","name"=>"تسويق وادارة مشاريع (م)", "time"=>1, "year"=>4,"date"=>"2022/7/20");
$data[]=array("name2"=>"روبوتية","name"=>"روبوتية", "time"=>3, "year"=>4,"date"=>"2022/7/4");
$data[]=array("name2"=>"بحوث عمليات","name"=>"بحوث عمليات", "time"=>1, "year"=>4,"date"=>"2022/7/6");
$data[]=array("name2"=>"هندسة برمجيات (2)","name"=>"هندسة برمجيات (2)", "time"=>3, "year"=>4,"date"=>"2022/7/31");
$data[]=array("name2"=>"نظم تشغيل (2)","name"=>"نظم تشغيل (2)", "time"=>6, "year"=>4,"date"=>"2022/7/16");
$data[]=array("name2"=>"شبكات عصبونية","name"=>"شبكات عصبونية", "time"=>1, "year"=>4,"date"=>"2022/7/28");
$data[]=array("name2"=>"أمن المعلومات","name"=>"أمن المعلومات", "time"=>1, "year"=>4,"date"=>"2022/6/27");



// سنة خامسة فصل أول
$data[]=array("name2"=>"نظم موزعة","name"=>"نظم موزعة", "time"=>1, "year"=>5,"date"=>"2022/7/17") ;
$data[]=array("name2"=>"نظم خبيرة","name"=>"نظم خبيرة", "time"=>1, "year"=>5,"date"=>"2022/7/17") ;
$data[]=array("name2"=>"نمذجة ومحاكاة","name"=>"نمذجة ومحاكاة", "time"=>3, "year"=>5,"date"=>"2022/6/30");
$data[]=array("name2"=>"تحكم منطقي مبرمج PLC","name"=>"تحكم منطقي مبرمج PLC", "time"=>3, "year"=>5,"date"=>"2022/7/30");
$data[]=array("name2"=>"جودة ووثوقية","name"=>"جودة ووثوقية", "time"=>3, "year"=>5,"date"=>"2022/7/21");
$data[]=array("name2"=>"أمن الشبكات","name"=>"أمن الشبكات", "time"=>1, "year"=>5,"date"=>"2022/7/24");
$data[]=array("name2"=>"رؤية حاسوبية","name"=>"رؤية حاسوبية", "time"=>1, "year"=>5,"date"=>"2022/7/24");
$data[]=array("name2"=>"هندسة برمجيات (3)","name"=>"هندسة برمجيات (3)", "time"=>1, "year"=>5,"date"=>"2022/7/24");

// سنة خامسة فصل ثاني
$data[]=array("name2"=>"شبكات لاسلكية","name"=>"شبكات لاسلكية", "time"=>3, "year"=>5,"date"=>"2022/7/6") ;
$data[]=array("name2"=>"ادارة نظم انتاجية","name"=>"ادارة نظم انتاجية", "time"=>3, "year"=>5,"date"=>"2022/8/3");
$data[]=array("name2"=>"معالجة لغات طبيعية","name"=>"معالجة لغات طبيعية", "time"=>1, "year"=>5,"date"=>"2022/7/19");
$data[]=array("name2"=>"نظم الزمن الحقيقي","name"=>"نظم الزمن الحقيقي", "time"=>6, "year"=>5,"date"=>"2022/6/27");
$data[]=array("name2"=>"تنقيب المعطيات","name"=>"تنقيب المعطيات", "time"=>3, "year"=>5,"date"=>"2022/7/26");

$data[]=array("name2"=>"نهاية البرنامج","name"=>"نهاية البرنامج", "time"=>1, "year"=>6,"date"=>"2000/1/1");


$startdate="2022/6/26";
$enddate="2022/8/4";

$period[1]="09:00";
$period[2]="11:30";
$period[3]="12:00";
$period[4]="02:00";
$period[5]="03:00";
$period[6]="02:30";

$dayweek[]="الاحد";
$dayweek[]="الاثنين";
$dayweek[]="الثلاثاء";
$dayweek[]="الاربعاء";
$dayweek[]="الخميس";
$dayweek[]="الجمعة";
$dayweek[]="السبت";
$datetext = "اليوم";
$title="برنامج الامتحان النظري - الفصل الثاني للعام الدراسي 2021/2022";
$subjecttext = "المادة";
$periodtext="الساعة";
//$title="Text messaging, or texting, is the act of composing and sending electronic messages";
?>